//////////////////////////////////////////////////////////////////////////
#pragma once
//////////////////////////////////////////////////////////////////////////
#ifndef MAP_INFO_H
#define MAP_INFO_H
//////////////////////////////////////////////////////////////////////////
#define ROW_NUM		12	/*地图行列数*/
#define COL_NUM		14
//////////////////////////////////////////////////////////////////////////
//========================================================================
typedef enum 
{
	MAP_BACK = '0',	//地图上的数字，'0'代表背景
	MAP_WALL,		//墙
	MAP_ROAD,		//道路
	MAP_BOX_NRM,	//正常状态的箱子
	MAP_BOX_FIS,	//已推入目的的箱子
	MAP_DEST,		//目的地
	MAP_MAN,		//人物
	MAP_BOMB		//炸弹

}MapType;
//========================================================================
typedef struct _MAPINFO_
{
	DWORD	ver;					//版本
	char	author[20];				//作者
	char	name[32];				//地图名称
	char	data[ROW_NUM][COL_NUM];	//数据y
	short	bomb;					//炸弹数

	struct _MAPINFO_ *prev;
	struct _MAPINFO_ *next;

}MAPINFO, MAPLIST, *PMAPINFO, *PMAPLIST;
//////////////////////////////////////////////////////////////////////////
#endif
//////////////////////////////////////////////////////////////////////////